<?php

return [

    /*
    |----------------------------------------------------------
    | زبان پیش‌فرض رابط کاربری
    |----------------------------------------------------------
    | 'fa' = فارسی | 'en' = انگلیسی
    */
    'lang' => 'fa',

    /*
    |----------------------------------------------------------
    | مسیر فونت تصویر کپچا
    |----------------------------------------------------------
    | فقط اسم فایل فونت رو بنویسید (از پوشه fonts/ می‌خونه)
    | اگه خالی بذارید، فونت سیستمی استفاده میشه
    */
    'font' => 'Vazirmatn.ttf',

    /*
    |----------------------------------------------------------
    | مدت اعتبار کپچا (ثانیه)
    |----------------------------------------------------------
    | بعد از این زمان، کد کپچا منقضی میشه
    | پیش‌فرض: 300 = ۵ دقیقه
    */
    'expiry' => 180,

    /*
    |----------------------------------------------------------
    | تعداد کاراکترها
    |----------------------------------------------------------
    */
    'length' => 5,

    /*
    |----------------------------------------------------------
    | ابعاد تصویر (پیکسل)
    |----------------------------------------------------------
    */
    'width'  => 170,
    'height' => 55,

    /*
    |----------------------------------------------------------
    | اندازه فونت در تصویر
    |----------------------------------------------------------
    */
    'font_size' => 22,

    /*
    |----------------------------------------------------------
    | نوع کاراکترها
    |----------------------------------------------------------
    | 'mixed'   = حروف + اعداد (پیش‌فرض)
    | 'letters' = فقط حروف
    | 'numbers' = فقط اعداد
	| 'characters' = فقط کاراکترها
    */
    'char_type' => 'mixed',

    /*
    |----------------------------------------------------------
    | حساسیت به بزرگ/کوچک بودن حروف
    |----------------------------------------------------------
    | false = کاربر بزرگ یا کوچک بنویسه فرقی نداره (توصیه شده)
    | true  = باید دقیقاً مثل تصویر وارد کنه
    */
    'case_sensitive' => false,

    /*
    |----------------------------------------------------------
    | میزان نویز تصویر
    |----------------------------------------------------------
| 'easy'    = ساده (فرم‌های معمولی)
    | 'medium'  = متوسط (پیش‌فرض)
    | 'hard'    = سخت (فرم‌های حساس)
    | 'extreme' = خیلی سخت (فرم‌های مالی/بانکی)
	| nightmare
	
	
    */
    'noise_level' => 'extreme',

];